package org.autojava;

//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
/*
.......................................
        ДЗ 4
        Задача 1. Дано две стринги А и B, если A не содержит B, напечатать -1, если содержит, то напечатать индекс из стринги A, с которого начинается стринга B в A
        Пример  1:
        Исходные данные: A = “asadbut", B = "sad"
        Результат: 1

        Пример 2:
        Исходные данные: A = "leetcode", B = "leeto"
        Результат: -1 так как А не содержит В

        Задача 2. Есть отсортированный массив и число. Если число есть в массиве то напечатать его индекс.
         Если числа нету, то напечатайте индекс, где число было бы, если бы оно было вставлено в массив.
        Пример 1:
        Исходные данные: : nums = [1,3,5,6], число = 5
        Результат: 2 - число 5 имеет индекс 2

        Пример 2:
        Исходные данные: : nums = [1,3,5,6], число = 2
        Результат: 1 - числа 2 нету в массиве, но если было бы, то индекс был бы 1, так как число 2 должно
        находится в массиве между числами 1 и 3

        Пример 3:
        Исходные данные: : nums = [1,3,5,6], число = 7
        Результат: 4 - числа 7 нету в массиве, но если бы было то после числа 6

        Задача 3. Есть массив. Напечатать true, если в массивы есть элементы, которые повторяются.
        Напечатать false, если массив содержит только уникальные числа

        Пример 1:
        Исходные данные: nums = [1,2,3,1]
        Результат: true

        Пример 2:
        Исходные данные: nums = [1,2,3,4]
        Результат: false

 */
    }
}